04_OpenFoam/_ref/OpenFOAM-14/multiRegion/film/rivuletPanel/system/extrudeToRegionMeshDict.film
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      extrudeToRegionMeshDict.film;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          film;

patches         (extrudeWall);

adaptMesh       yes;

patchTypes      (mappedWall);
patchNames      (wall);

regionPatchTypes   (mappedFilmWall);
regionPatchNames   (wall);

regionOppositePatchTypes    (empty);
regionOppositePatchNames    (empty);

extrudeModel
{
    type            linearNormal;

    nLayers         1;
    expansionRatio  1;

    thickness       0.01;
}

// ************************************************************************* //
